# # №1 calculator
# # while True:
# #     znak = input("Выберите знак: +, -, *, /.")
# #     a = int(input("Введите первое число: "))
# #     b = int(input("Введите второе число: "))
# #     if znak =="+":
# #         print(a+b)
# #     elif znak =="-":
# #         print(a-b)
# #     elif znak =="*":
# #         print(a*b)
# #     elif znak =="/":
# #         if b !=0:
# #             print(a/b)
# #         else:
# #             print("Деление на 0 невозможно!")
# #     else:
# #         print("Что то пошло не так:( Попробуйте снова!")



#problem2
'''
a=int(input("Число a: "))
b=int(input("Число b: "))
c=int(input("Число c: "))
a=a+b
b=c-a
c=a+b+c
print(a, b, c,)'''
#problem3 
"""a = int(input("Введите число: "))
print ("Площадь квадрата равно", a**2,",а периметр равно", a*4 )"""




# Хакатон 1 Задание 4
# a =(14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0) 
# b =set([14,10,35,45,'60',70,90,0,105,150,'70']) 
# c =set([14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]) 
# d =set([14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']) 
# s = set(a) 
# f = set(b) 
# j =set(c) 
# k =set(d) 
# if len(a) != len(s): 
#     print("Для переменной а последовательность не уникальна.") 
# else: 
#     print('Последовательность уникальна.') 
 
# if len(b) != len(f): 
#     print('Последовательность не уникальна.') 
# elif len(b) == len(f): 
#     print('Для переменной b последовательность уникальна.') 
 
# if len(c) != len(j): 
#     print('Последовательность не уникальна') 
# elif len(c) == len(j): 
#     print('Для переменной c последовательность уникальна') 
 
# if len(d) != len(k): 
#     print('Последовательность не уникальна') 
# elif len(d) == len(k): 
#     print('Для переменной d последовательность уникальна')



#problem6
'''number = list(str(input("Введите число: ")))
if number[0] > number [1] > number[2] > number[3]:
    print('Да')
else:
    print('Нет')'''


